template/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          24;
        startFace       41353;
    }
    outlet
    {
        type            patch;
        nFaces          89;
        startFace       41377;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          24;
        startFace       41466;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          24;
        startFace       41490;
    }
    shape
    {
        type            wall;
        inGroups        1(wall);
        nFaces          169;
        startFace       41514;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          54456;
        startFace       41683;
    }
)

// ************************************************************************* //
